Libs/DataProviders/DataProviders/Service References/Camiher/Camiher.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="Camiher" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/CamiherWCFServices" />
      <xs:import namespace="http://schemas.datacontract.org/2004/07/Camiher.Libs.Server.WebServicesObjects" />
      <xs:element name="GetData">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="value" type="xs:int" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetDataResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetDataUsingDataContract">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/CamiherWCFServices" minOccurs="0" name="composite" nillable="true" type="q1:CompositeType" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetDataUsingDataContractResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q2="http://schemas.datacontract.org/2004/07/CamiherWCFServices" minOccurs="0" name="GetDataUsingDataContractResult" nillable="true" type="q2:CompositeType" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="ClientBuyProduct">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="clientId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="productId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="currentSale" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="ClientBuyProductResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q3="http://schemas.datacontract.org/2004/07/Camiher.Libs.Server.WebServicesObjects" minOccurs="0" name="ClientBuyProductResult" nillable="true" type="q3:BaseResponse" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetCurrentSale">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="clientId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="productId" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="GetCurrentSaleResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q4="http://schemas.datacontract.org/2004/07/Camiher.Libs.Server.WebServicesObjects" minOccurs="0" name="GetCurrentSaleResult" nillable="true" type="q4:SaleResponse" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/CamiherWCFServices" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/CamiherWCFServices" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:complexType name="CompositeType">
        <xs:sequence>
          <xs:element minOccurs="0" name="BoolValue" type="xs:boolean" />
          <xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="CompositeType" nillable="true" type="tns:CompositeType" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/Camiher.Libs.Server.WebServicesObjects" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Camiher.Libs.Server.WebServicesObjects" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:complexType name="BaseResponse">
        <xs:sequence />
      </xs:complexType>
      <xs:element name="BaseResponse" nillable="true" type="tns:BaseResponse" />
      <xs:complexType name="SaleResponse">
        <xs:complexContent mixed="false">
          <xs:extension base="tns:BaseResponse">
            <xs:sequence />
          </xs:extension>
        </xs:complexContent>
      </xs:complexType>
      <xs:element name="SaleResponse" nillable="true" type="tns:SaleResponse" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="ICamiherService_GetData_InputMessage">
    <wsdl:part name="parameters" element="tns:GetData" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_GetData_OutputMessage">
    <wsdl:part name="parameters" element="tns:GetDataResponse" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_GetDataUsingDataContract_InputMessage">
    <wsdl:part name="parameters" element="tns:GetDataUsingDataContract" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_GetDataUsingDataContract_OutputMessage">
    <wsdl:part name="parameters" element="tns:GetDataUsingDataContractResponse" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_ClientBuyProduct_InputMessage">
    <wsdl:part name="parameters" element="tns:ClientBuyProduct" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_ClientBuyProduct_OutputMessage">
    <wsdl:part name="parameters" element="tns:ClientBuyProductResponse" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_GetCurrentSale_InputMessage">
    <wsdl:part name="parameters" element="tns:GetCurrentSale" />
  </wsdl:message>
  <wsdl:message name="ICamiherService_GetCurrentSale_OutputMessage">
    <wsdl:part name="parameters" element="tns:GetCurrentSaleResponse" />
  </wsdl:message>
  <wsdl:portType name="ICamiherService">
    <wsdl:operation name="GetData">
      <wsdl:input wsaw:Action="http://tempuri.org/ICamiherService/GetData" message="tns:ICamiherService_GetData_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICamiherService/GetDataResponse" message="tns:ICamiherService_GetData_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="GetDataUsingDataContract">
      <wsdl:input wsaw:Action="http://tempuri.org/ICamiherService/GetDataUsingDataContract" message="tns:ICamiherService_GetDataUsingDataContract_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICamiherService/GetDataUsingDataContractResponse" message="tns:ICamiherService_GetDataUsingDataContract_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="ClientBuyProduct">
      <wsdl:input wsaw:Action="http://tempuri.org/ICamiherService/ClientBuyProduct" message="tns:ICamiherService_ClientBuyProduct_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICamiherService/ClientBuyProductResponse" message="tns:ICamiherService_ClientBuyProduct_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="GetCurrentSale">
      <wsdl:input wsaw:Action="http://tempuri.org/ICamiherService/GetCurrentSale" message="tns:ICamiherService_GetCurrentSale_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ICamiherService/GetCurrentSaleResponse" message="tns:ICamiherService_GetCurrentSale_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_ICamiherService" type="tns:ICamiherService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="GetData">
      <soap:operation soapAction="http://tempuri.org/ICamiherService/GetData" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="GetDataUsingDataContract">
      <soap:operation soapAction="http://tempuri.org/ICamiherService/GetDataUsingDataContract" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="ClientBuyProduct">
      <soap:operation soapAction="http://tempuri.org/ICamiherService/ClientBuyProduct" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="GetCurrentSale">
      <soap:operation soapAction="http://tempuri.org/ICamiherService/GetCurrentSale" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Camiher">
    <wsdl:port name="BasicHttpBinding_ICamiherService" binding="tns:BasicHttpBinding_ICamiherService">
      <soap:address location="http://localhost:7420/Camiher.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>