samples/get-basic-req-with-headers.txt

POST http://localhost:53016/Service1.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
VsDebuggerCausalityData: uIDPoy6B3DCzWO5Dj/n78OwtfmcAAAAA5msNxjeXbUifbsUhPmy3wjDMIwR0yAVJvzxiBSl7EFcACQAA
SOAPAction: "http://tempuri.org/IService1/GetData"
Host: localhost:53016
Content-Length: 158
Expect: 100-continue
Accept-Encoding: gzip, deflate
Connection: Keep-Alive

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<GetData xmlns="http://tempuri.org/">
			<value>10</value>
		</GetData>
	</s:Body>
</s:Envelope>
